{
  "basics": {
    "name": "Adrian Lynch",
    "label": "Senior Developer",
    "picture": "",
    "email": "adelynch(@)gmail.com",
    "phone": "",
    "website": "http://adrianlynch.co.uk/",
    "summary": "I am an enthusiastic senior web applications developer with a broad skill set, specialising in JavaScript in Node and the browser as well as over 14 years experience with CFML and SQL. I am able to work on my own initiative and as part of a team, I have managed and led projects from initial conception and requirement analysis through to completion.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "London and the South East",
      "countryCode": "UK",
      "region": ""
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "adrianblynch",
        "url": "https://github.com/adrianblynch"
      },
      {
        "network": "Stackoverflow",
        "username": "Adrian Lynch",
        "url": "http://stackoverflow.com/users/121946/adrian-lynch"
      },
      {
        "network": "Twitter",
        "username": "adrianblynch",
        "url": "https://twitter.com/AdrianBLynch"
      },
      {
        "network": "LinkedIn",
        "username": "Adrian Lynch",
        "url": "https://www.linkedin.com/in/adrian-lynch-8237a21"
      }
    ]
  },
  "work": [
    {
      "company": "Concrete Media Ltd",
      "position": "Senior Engineer/Team Lead",
      "website": "http://www.concreteplatform.com/",
      "startDate": "2012",
      "endDate": "Present",
      "summary": "A digital asset management platform for retailers, combining workflow, planning, communications and job management to aid collaboration in an enterprise environment.",
      "highlights": [
        "Designed and built a Node REST API and Backbone/Marionette front-end to replace a legacy platform.",
        "Helped transition a Backbone/Marionette/MVC front-end application to Backbone/Rivets/TypeScript/MVVM.",
        "Designed a Roles API backed by a graph database for authorisation of resources to requesting users",
        "Designed and built a site configuration application to automate client site generation. Ensuring consistency and saving both the engineering and infrastructure teams hours on each new client set-up.",
        "Built an API on top of the configuration application to expose data to internal services.",
        "Lead teams on multiple application rewrites using Backbone/Marionette.",
        "Consolidated multiple access rights across different clients as part of an access right audit.",
        "Introduced testing (TDD, integration, end-to-end) into the development team's workflow.",
        "Transitioned into a team lead role to mentor and coach other developers.",
        "Took part in the hiring of new engineers at junior, senior and technical architect level.",
        "Ensured the smooth start-up of new hires with guides, documentation and application and code walk-throughs.",
        "Started Code Club sessions to promote discussion and demos of interest.",
        "Line managed developers, doing one-to-ones, goal setting and performance reviews.",
        "Performed an analysis of penetration test results to highlight the issues. Created demos to showcase the vulnerabilies and documented possible mitigations."
      ]
    },
    {
      "company": "Halestorm Ltd",
      "position": "Owner/Developer",
      "website": "http://www.halestorm.co.uk/",
      "startDate": "2008",
      "endDate": "2012",
      "summary": "A web development company offering hosting and application services.",
      "highlights": [
        "Provided full-stack web development, SEO and web design services for clients.",
        "Provided managed hosting for clients on a Windows, Apache, Tomcat, Railo and SQL Server stack.",
        "Developed a hosted content management system to speed up website creation.",
        "Liaised with clients through all parts of the development cycle, from initial requirements gathering through to development and support.",
        "Orchestrated design work with external suppliers.",
        "Managed client accounts, contracts and pricing agreements.",
        "Sourced new clients through networking, social media and existing contacts."
      ]
    },
    {
      "company": "Property Owl Ltd",
      "position": "Lead Developer",
      "website": "http://www.propertyowl.co.uk/",
      "startDate": "2007",
      "endDate": "2008",
      "summary": "A start-up competing with the major property portals (Rightmove, PrimeLocation) and estate agent software providers (Expert Agent, Vebra).",
      "highlights": [
        "Led the portal's design and build.",
        "Integrated the portal with external property sites such as Rightmove and PrimeLocation.",
        "Built the server infrastructure.",
        "Created a site templating application for rapid client site generation."
      ]
    },
    {
      "company": "Freelance",
      "position": "Web Application Developer",
      "website": "",
      "startDate": "2004",
      "endDate": "2007",
      "summary": "As a freelance developer I completed worked for organisations including Merrill Lynch, Deloitte, Boeing, Coke, Barclaycard, DfES, the National Lottery, Shell, PricewaterhouseCoopers, Diageo, building websites and applications.",
      "highlights": [
        "O2 Events - Designed and built a system for the O2 Events team to organise their UK and European promotional tours.",
        "Implemented SiteCore CMS for three government agencies, The Training and Development Agency for Schools, The Information Commissioner's Office and the Institute of Educational Assessors.",
        "Designed and built an advertising awards show media upload service which took video, audio and image files as part of the entry process and allowed modifications and conversions for judging across different devices."
      ]
    },
    {
      "company": "Thoughtbubble Ltd",
      "position": "Junior/Senior Developer",
      "website": "http://www.thoughtbubble.com/",
      "startDate": "2001",
      "endDate": "2004",
      "summary": "A London based web development agency.",
      "highlights": [
        "Progressed from junior to senior developer.",
        "Liaised with stakeholders for requirements gathering. ",
        "Introduced better development techniques such as modularisation, encapsulation, DRY principals and code generation."
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "Open University",
      "area": "Software Development",
      "studyType": "",
      "startDate": "2003",
      "endDate": "2003",
      "gpa": "",
      "courses": [
        "M206 - Computing: An Object Oriented Approach (Distinction pass)"
      ]
    },
    {
      "institution": "Self learning",
      "area": "Certifications",
      "studyType": "",
      "courses": [
        "M101P: MongoDB for Developers (Pass mark of 100%)",
        "Certified Advanced ColdFusion Developer 6/7/8/9 (Pass marks of 94%, 98%, 98%, 83%)",
        "Brainbench certificates in HTML 3.2, XML Concepts, RDBMS Concepts, JavaScript, JavaScript 1.5 Fundamentals, ColdFusion 5 and ColdFusion 8"
      ]
    },
    {
      "institution": "St. Thomas More RC School",
      "area": "Secondary School",
      "studyType": "",
      "startDate": "1989",
      "endDate": "1998",
      "gpa": "",
      "courses": [
        "A-Level Maths, Physics and Economics",
        "GCSE Maths, Double Science, English Language/Literature, Geography, Art, Religious Education and Business Studies"
      ]
    }
  ],
  "awards": [],
  "publications": [],
  "skills": [
    {
      "name": "Web Development",
      "level": "Master",
      "keywords": [
        "Node",
        "JavaScript",
        "SQL",
        "jQuery",
        "HTML",
        "CSS",
        "Backbone",
        "Marionette",
        "ColdFusion",
        "Railo",
        "NoSQL",
        "REST"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    }
  ],
  "interests": [
    {
      "name": "Sport",
      "keywords": [
        "Running",
        "Badminton"
      ]
    }
  ],
  "references": [
    {
      "name": "James Maltby -  CEO Thoughtbubble",
      "reference": "I first hired Adrian as an office junior and then watched him learn and develop his skills into one of the best and brightest developers I've seen in twenty years. He been a great asset to us both as a full time employee and again, later, as an occasional freelancer. I would highly recommend him across the board for his skills, professionalism and great personality."
    },
    {
      "name": "Andrew Clarke - Lead Engineer at Tido Music",
      "reference": "Adrian is a conscientious, talented software engineer who delivers quality software whilst always wanting to do better. Adrian mentors colleagues by pushing them to read, learn and try new technologies, whilst keeping a pragmatic view on the usefulness of these technologies to solve the real world problem. I'd welcome the chance to work with Adrian again, and recommend him to anyone who needs to get stuff done, instead of just talking about it."
    }
  ]
}
